

#+title: Emacs Startup Initialization

#+name: lexical-binding
#+begin_src emacs-lisp :comments no :tangle yes
  ;; -*- lexical-binding: t -*-
#+end_src

#+RESULTS: lexical-binding

* startup behavior
#+begin_src emacs-lisp
  (desktop-save-mode 1)
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
  ;; show this file first.
(setq initial-buffer-choice
      "~/notes/journal.org")
#+end_src

#+RESULTS:
: ~/notes/journal.org

* unsorted
#+begin_src emacs-lisp
;;bypass using the meta key
(global-set-key "\C-x\C-m" 'execute-extended-command)
(global-set-key "\C-c\C-m" 'execute-extended-command)

;;mistake convenience
(global-set-key "\C-w" 'backward-kill-word)
(global-set-key "\C-x\C-k" 'kill-region)
(global-set-key "\C-c\C-k" 'kill-region)

;; backup files
(setq backup-directory-alist `(("." . "~/.saves")))

;; margins alternate
(fringe-mode '(16 . 16))

;; cc modes and the like.
(setq-default c-default-style "linux"
              c-basic-offset 4)
#+end_src

#+RESULTS:
: 4

* user info
#+begin_src emacs-lisp
  (setq user-full-name "Nikita Mogilevsky"
        user-email-address "nikitamog@gmail.com")
#+end_src

#+RESULTS:
: nikitamog@gmail.com

* reading documents
#+begin_src emacs-lisp
  (straight-use-package
   '(pdf-tools :type git
               :host github
               :repo "vedang/pdf-tools"))
  (pdf-loader-install) ; On demand loading, leads to faster startup time
#+end_src

#+RESULTS:
: ((%PDF . #[0 \301\302\300"\207 [(nil nil nil nil) apply pdf-loader--load] 3]))

* org-mode extensions

org-mode is preloaded before this file.

#+name org-mode hooks
#+begin_src emacs-lisp
  ;; paragraph wrapping.
  (add-hook 'org-mode-hook 'auto-fill-mode)
#+end_src

#+begin_src emacs-lisp
  (setq org-agenda-files '("~/notes"))
#+end_src

#+RESULTS:
| ~/notes |

#+begin_src emacs-lisp
(setq org-ellipsis "⤵")
(setq org-src-tab-acts-natively t)
(setq org-startup-with-inline-images t)

;; Close TODOs with a timestamp
(setq org-log-done 'time)

;; global defaults for org
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c C-o") 'org-open-at-point-global)
(global-set-key (kbd "C-c C-l") 'org-insert-link-global)
(global-set-key (kbd "C-c o") 'org-info)
(global-set-key (kbd "C-; C-f") 'toggle-frame-fullscreen)
#+end_src

#+RESULTS:
: toggle-frame-fullscreen

